/**
 * 奖品设置
 * type: 唯一标识，0是默认特别奖的占位符，其它奖品不可使用
 * count: 奖品数量
 * title: 奖品描述
 * text: 奖品标题
 * img: 图片地址
 */
const prizes = [
  "哈曼卡顿音响",
  "现金奖励",
  "德龙复古咖啡机",
  "现金奖励",
  "京东E卡",
  "现金奖励",
  "龙年转运金珠",
  "现金奖励",
  "转运金豆豆",
  "现金奖励",
  "京东E卡",
  "现金奖励",
  "转运金豆豆-张兰兰",
  "现金奖励",
  "大疆灵眸",
  "现金奖励",
  "小米照片打印机",
  "现金奖励",
  "京东E卡",
  "现金奖励",
  "爱马仕香水身体乳礼盒",
  "现金奖励",
  "京东E卡",
  "现金奖励",
  "转运金豆豆",
  "现金奖励",
  "小米照片打印机",
  "现金奖励",
  "转运金豆豆",
  "京东E卡",
  "机械键盘",
  "现金奖励",
  "转运金豆豆",
  "现金奖励",
  "京东E卡",
  "现金奖励",
  "机械键盘",
  "现金奖励",
  "京东E卡",
  "现金奖励",
  "香奈儿coco香水礼盒",
  "京东E卡",
  "现金奖励",
  "转运金豆豆",
  "现金奖励-赵泽超",
  "PS5",
  "奈雪麒麟卡",
  "奈雪麒麟卡",
  "奈雪麒麟卡",
].map((name, index) => {
  return {
    type: name.indexOf("-") > -1 ? name.replace(/.*-/ig, "") : index + 1,
    count: name == "奈雪麒麟卡" ? 10 : 1,
    title: name.replace(/-.*/ig, ""),
    text: "",
    all: true,
    img: ""
  }
}).reverse();

/**
 * 一次抽取的奖品个数与prizes对应
 */
const EACH_COUNT = prizes.map(i => i.count);

/**
 * 卡片公司名称标识
 */
const COMPANY = "贵州多彩新媒体";

module.exports = {
  prizes,
  EACH_COUNT,
  COMPANY
};
